Documents/ВводНачальныхДанныхЗакрепления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводНачальныхДанныхЗакрепления</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаОтдел</xr:Item>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВводНачальныхДанныхЗакрепления/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаКомандыФормы(Команда)
	Если Команда.Имя = "Свернуть" Тогда
		СвернутьПоСтрокам();
	ИначеЕсли Команда.Имя = "СвернутьПоДолжникам" Тогда
		СвернутьПоДолжникам();
	ИначеЕсли Команда.Имя = "Обработка1" Тогда
		Обработка1();
	ИначеЕсли Команда.Имя = "ПроставитьАрхив" Тогда
		ПроставитьАрхив();
	ИначеЕсли Команда.Имя = "УдалитьКонтроль1" Тогда
		УдалитьКонтроль1();
	КонецЕсли;
КонецПроцедуры

Процедура СвернутьПоСтрокам()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Отдел, Сотрудник", "");
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

Процедура СвернутьПоДолжникам()
	Об = РеквизитФормыВЗначение("Объект");
	
	ТЗ = Об.Должники.Выгрузить();
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.ЗаполнитьЗначения(1, "Количество");
	ТЗ.Свернуть("Должник", "Количество");
	
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должник", СтрокаТЗ.Должник);
		НайденныеСтроки = Об.Должники.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
			СтрокаДолжники.Контроль = СтрокаТЗ.Количество;
		КонецЦикла; 
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

Процедура Обработка1()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Должники.Свернуть("Должник, Отдел, Сотрудник", "");
	
	ТЗ = Об.Должники.Выгрузить();
	ТЗ.Колонки.Добавить("Количество");
	
	ТЗ.ЗаполнитьЗначения(1, "Количество");
	
	ТЗ.Свернуть("Должник", "Количество");
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		Если СтрокаТЗ.Количество < 2 Тогда
			Продолжить;
		КонецЕсли; 
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Должник", СтрокаТЗ.Должник);
		НайденныеСтроки = Об.Должники.НайтиСтроки(ПараметрыОтбора);
		
		Пустая = Неопределено;
		Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
			Если СтрокаДолжники.Отдел.Пустая() И СтрокаДолжники.Сотрудник.Пустая() Тогда
				СтрокаДолжники.Отдел = Архив;
				Сообщить(СтрШаблон("Изменена %1 %2 %3.", СтрокаДолжники.Отдел, СтрокаДолжники.Сотрудник, СтрокаДолжники.Должник));
				Пустая = СтрокаДолжники;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ Пустая = Неопределено Тогда
			Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
				Если НЕ Пустая = СтрокаДолжники Тогда
					Сообщить(СтрШаблон("Удалена %1 %2 %3.", СтрокаДолжники.Отдел, СтрокаДолжники.Сотрудник, СтрокаДолжники.Должник));
					Об.Должники.Удалить(СтрокаДолжники);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьАрхив()
	Для каждого СтрокаДолжники Из Объект.Должники Цикл
		Если ЗначениеЗаполнено(СтрокаДолжники.Отдел) = Ложь И ЗначениеЗаполнено(СтрокаДолжники.Сотрудник) = Ложь Тогда
			СтрокаДолжники.Отдел = Архив;
			Сообщить(СтрШаблон("Изменена %1 %2 %3.", СтрокаДолжники.Отдел, СтрокаДолжники.Сотрудник, СтрокаДолжники.Должник));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтроль1()
	СтруктураОтбора = Новый Структура("Контроль", 1);
	НайденныеСтроки = Объект.Должники.НайтиСтроки(СтруктураОтбора);
	Для каждого СтрокаДолжники Из НайденныеСтроки Цикл
		Объект.Должники.Удалить(СтрокаДолжники);
	КонецЦикла;
КонецПроцедуры
